TexasInstruments/f29h85x-mcal/drivers/Spi/include/Spi_Priv.h
/*********************************************************************************************************************
 *  COPYRIGHT
 *  ------------------------------------------------------------------------------------------------------------------
 *  \verbatim
 *
 *                 TEXAS INSTRUMENTS INCORPORATED PROPRIETARY INFORMATION
 *
 *                 Property of Texas Instruments, Unauthorized reproduction and/or distribution
 *                 is strictly prohibited.  This product  is  protected  under  copyright  law
 *                 and  trade  secret law as an  unpublished work.
 *                 (C) Copyright 2025 Texas Instruments Inc.  All rights reserved.
 *
 *  \endverbatim
 *  ------------------------------------------------------------------------------------------------------------------
 *  FILE DESCRIPTION
 *  ------------------------------------------------------------------------------------------------------------------
 *  File:       Spi_Priv.h
 *  Generator:  None
 *
 *  Description:  This file contains data structures and function declarations private to Spi
 *
 *********************************************************************************************************************/
#ifndef SPI_PRIV_H
#define SPI_PRIV_H
/*********************************************************************************************************************
 * If building with a C++ compiler, make all of the definitions in this header
 * have a C binding.
 *********************************************************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif
/*********************************************************************************************************************
 * Header Files
 *********************************************************************************************************************/
#include "Spi.h"
#include "SchM_Spi.h"
#include "Spi_Utils.h"
#include "hw_spi.h"
#include "hw_pipe.h"
#include "hw_ints.h"
#include "hw_types.h"
#include "hw_memmap.h"
#include "Det.h"

/*********************************************************************************************************************
 * Version Check (if required)
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Preprocessor #define Constants
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Preprocessor #define Macros
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Type Declarations
 *********************************************************************************************************************/
/** \brief Pre-declaration for HW unit object */
typedef struct Spi_HwUnitObjType_t Spi_HwUnitObjType;

/** \brief These are the possible levels a chip select */
typedef uint8 Spi_CsLevelType;
/*********************************************************************************************************************
 * Exported Object Declarations
 *********************************************************************************************************************/

/**
 *  \brief SPI Buffer pointer type.
 */

typedef enum
{
    /** \brief SPI 8 bit buffer */
    SPI_8BIT_BUFFER,
    /** \brief SPI 16 bit buffer */
    SPI_16BIT_BUFFER

} Spi_BufferWidthType;
/*
 * Design : MCAL-24874, MCAL-24877, MCAL-24881, MCAL-25177
 */

/**
 *  \brief SPI Channel object structure.
 */

typedef struct
{
    /** \brief SPI channel config passed during init */
    const Spi_ChannelConfigType *chCfg;
    /** \brief TX buffer pointer given by user. This should be persistent */
    P2CONST(Spi_DataBufferType, AUTOMATIC, SPI_APPL_DATA) txBufPtr;
    /** \brief RX buffer pointer given by user. This should be persistent */
    P2VAR(Spi_DataBufferType, AUTOMATIC, SPI_APPL_DATA) rxBufPtr;

#if ((SPI_CHANNEL_BUFFERS == SPI_IB) || (SPI_CHANNEL_BUFFERS == SPI_IB_EB))
    /** \brief Internal TX buffer */
    volatile Spi_DataBufferType txIb[SPI_IB_MAX_LENGTH];
    /** \brief Internal RX buffer */
    volatile Spi_DataBufferType rxIb[SPI_IB_MAX_LENGTH];
#endif
    /** \brief Current TX buffer pointer */
    volatile const uint8 *curTxBufPtr;
    /** \brief Current RX buffer pointer */
    volatile uint8       *curRxBufPtr;
    /** \brief Number of words to transfer */
    Spi_NumberOfDataType  numWordsTxRx;
    /** \brief   Number of words transmitted. We need separate counters for
     *   TX/RX because when FIFO in enabled, TX writes happen in
     *   advance where as RX will happen on actual received data. */
    Spi_NumberOfDataType  curTxWords;
    /** \brief Number of words received */
    Spi_NumberOfDataType  curRxWords;
    /** \brief   Width of buffer in bytes-used for accessing the TX/RX buffer.
     *   When dataWidth < 9,           bufWidth = uint8 (1 bytes)
     *   When dataWidth >= 9  && < 17, bufWidth = uint16 (2 bytes)
     */
    Spi_BufferWidthType   bufWidth;
    /** \brief Effective TX FIFO depth in words - depends on dataWidth */
    uint16                effTxFifoDepth;
    /** \brief Data width mask depending on SPI word size */
    uint16                dataWidthBitMask;

} Spi_ChannelObjType;

/*
 * Design : MCAL-25178
 */

/**
 *  \brief SPI Sequence object structure.
 */
typedef struct
{
    /** \brief SPI sequence config passed during init */
    const Spi_SeqConfigType *seqCfg;
    /** \brief SPI sequence result/status */
    Spi_SeqResultType        seqResult;
    /** \brief Number of jobs still pending.Used for notifying sequence end */
    uint32                   numJobsPending;

} Spi_SeqObjType;

