TexasInstruments/f29h85x-mcal/drivers/Spi/include/Spi_Priv.h
/*
 * Design : MCAL-25179
 */

/**
 *  \brief SPI Job object structure.
 */
typedef struct
{
    /** \brief SPI job config passed during init */
    const Spi_JobConfigType      *jobCfg;
    /** \brief SPI job config passed during init */
    Spi_ExternalDeviceConfigType *extDevCfg;
    /** \brief SPI job result/status */
    Spi_JobResultType             jobResult;
    /** \brief SPI HW unit object as ID and array index may not be same.
     * This is used for easy de-referencing */
    Spi_HwUnitObjType            *hwUnitObj;
    /** \brief SPI sequence object pointer to which the job belongs.
     * This is used for easy de-referencing */
    Spi_SeqObjType               *seqObj;
    /** \brief Node object used for node memory to be used in link list */
    Spi_UtilsNode                 nodeObj;
    /** \brief Current channel index. Used for notifying job end */
    uint32                        curChIdx;
    /** \brief TX FIFO trigger level in bytes */
    uint32                        txFifoTrigLvl;
    /** \brief RX FIFO trigger level in bytes */
    uint32                        rxFifoTrigLvl;
} Spi_JobObjType;

/*
 * Design : MCAL-25180
 */

/**
 *  \brief SPI Hardware unit object structure.
 */
struct Spi_HwUnitObjType_t
{
    /** \brief SPI HW unit config passed during init */
    const Spi_HwUnitConfigType *hwUnitCfg;
    /** \brief SPI HW unit result/status */
    Spi_HwUnitResultType        hwUnitResult;
    /** \brief Base address of the hardware */
    uint32                      baseAddr;
    /** \brief Job link list per hardware */
    Spi_UtilsLinkListObj        jobList;
    /** \brief When hardware is busy, this points to the current job that
     * is in progress. When hardware is idle, this will be NULL */
    Spi_JobObjType             *curJobObj;
    /** \brief Currently configured job ID. Used to avoid re-configuring the
     * hardware again when the same job ID is used back to back */
    Spi_JobType                 curConfiguredJobId;
    /* current DEM status for this HW unit */
    Std_ReturnType              hwUnitDemState;
};

/*
 * Design : MCAL-25181
 */

/**
 *  \brief SPI driver object structure.
 */
typedef struct
{
    /** \brief Flag to indicate any async transfer is in progress */
    uint32                       isAsyncInProgress;
    /** \brief Async mode set by user */
    Spi_AsyncModeType            asyncMode;
    /** \brief Maximum number of channels.
     * Should not be more than SPI_MAX_CHANNELS */
    uint8                        maxChannels;
    /** \brief Maximum number of jobs
     * Should not be more than SPI_MAX_JOBS */
    uint8                        maxJobs;
    /** \brief Maximum number of sequences
     * Should not be more than SPI_MAX_SEQ */
    uint8                        maxSeq;
    /** \brief Maximum number of HW unit
     * Should not be more than SPI_MAX_HW_UNIT */
    uint8                        maxHwUnit;
    /** \brief Maximum number of external device configurations
     * Should not be more than SPI_MAX_EXT_DEV */
    uint8                        maxExtDevCfg;
    /** \brief SPI channel objects */
    Spi_ChannelObjType           channelObj[SPI_MAX_CHANNELS];
    /** \brief SPI job objects */
    Spi_JobObjType               jobObj[SPI_MAX_JOBS];
    /** \brief SPI sequence objects */
    Spi_SeqObjType               seqObj[SPI_MAX_SEQ];
    /** \brief SPI hw unit objects */
    Spi_HwUnitObjType            hwUnitObj[SPI_MAX_HW_UNIT];
    /** \brief External HW device config */
    Spi_ExternalDeviceConfigType extDevCfg[SPI_MAX_EXT_DEV];

} Spi_DriverObjType;

/*
 * Design : MCAL-25182
 */
/** \brief SPI driver status */
extern volatile Spi_StatusType Spi_DrvStatus;
/*********************************************************************************************************************
 *  Exported Function Prototypes
 *********************************************************************************************************************/

/** \brief function to reset driver object
 *
 *  function to reset driver object
 *
 * \param[in] drvObj: pointer to driver object
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE) Spi_ResetDrvObj(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj);

/** \brief function to copy configuration into driver obj
 *
 *  function to copy driver object
 *
 * \param[in] drvObj: pointer to driver object
 * \param[in] cfgPtr: pointer to configuration
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_CopyConfig(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
               P2CONST(Spi_ConfigType, AUTOMATIC, SPI_CODE) cfgPtr);

/** \brief function to initialize SPI hardware unit
 *
 *  function to initialize SPI hardware unit
 *
 * \param[in] drvObj: pointer to driver object
 * \param[in] hwUnitObj: pointer to hardware unit object
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_HwUnitInit(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
               P2VAR(Spi_HwUnitObjType, AUTOMATIC, SPI_CODE) hwUnitObj);

/** \brief function to de-initialize SPI hardware unit
 *
 *  function to de-initialize SPI hardware unit
 *
 * \param[in] hwUnitObj: pointer to hardware unit object
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE) Spi_HwUnitDeInit(P2VAR(Spi_HwUnitObjType, AUTOMATIC, SPI_CODE) hwUnitObj);

/** \brief function to get hardware unit object based on HW unit ID
 *
 *  function to get hardware unit object based on HW unit ID
 *
 * \param[in] HWUnit: Hw unit ID
 * \param[in] drvObj: pointer to driver object
 * \pre None
 * \post None
 * \return return found hardware unit object based on HW unit ID
 * \retval Spi_HwUnitObjType: pointer to HW unit object
 *
 ********************************************************************************************************************/
Spi_HwUnitObjType *Spi_GetHwUnitObj(VAR(Spi_HWUnitType, AUTOMATIC) HWUnit,
                                    P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj);

/** \brief function to disable all the interrupts
 *
 *  function to disable all the interrupts
 *
 * \param[in] baseAddr: HW unit base address
 * \param[in] isFifoEnabled: FIFO enhancement mode enabled or disabled
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_DisableInterrupt(VAR(uint32, AUTOMATIC) baseAddr, VAR(boolean, AUTOMATIC) isFifoEnabled);

