TexasInstruments/f29h85x-mcal/drivers/Spi/include/Spi_Priv.h
/** \brief function to enable interrupts
 *
 *  function to enable interrupts
 *
 * \param[in] baseAddr: HW unit base address
 * \param[in] isFifoEnabled: FIFO enhancement mode enabled or disabled
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_EnableInterrupt(VAR(uint32, AUTOMATIC) baseAddr, VAR(boolean, AUTOMATIC) isFifoEnabled);

/** \brief private function to start Asynchronous transmission
 *
 *  private function to start Asynchronous transmission
 *
 * \param[in] drvObj: pointer to driver object
 * \param[in] seqObj: pointer to sequence object
 * \pre None
 * \post None
 * \return returns the status of the async transfer start
 * \retval E_OK: sequence transfer start in async mode is success
 * \retval E_NOT_OK: sequence transfer start in async mode failed
 *
 ********************************************************************************************************************/
FUNC(Std_ReturnType, SPI_CODE)
Spi_StartSeqAsync(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
                  P2VAR(Spi_SeqObjType, AUTOMATIC, SPI_CODE) seqObj);

/** \brief private function to start synchronous transmission
 *
 *  private function to start synchronous transmission
 *
 * \param[in] drvObj: pointer to driver object
 * \param[in] seqObj: pointer to sequence object
 * \pre None
 * \post None
 * \return returns the status of the async transfer start
 * \retval E_OK: sequence transfer start in sync mode is success
 * \retval E_NOT_OK: sequence transfer start in sync mode failed
 *
 ********************************************************************************************************************/
FUNC(Std_ReturnType, SPI_CODE)
Spi_StartSeqSync(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
                 P2VAR(Spi_SeqObjType, AUTOMATIC, SPI_CODE) seqObj);

/** \brief process receive interrupt(RXINT/INT)
 *
 *  function to process receive interrupt
 *
 * \param[in] hwUnitId: Id of Hardware Unit
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE) Spi_ProcessRxEvent(VAR(Spi_HWUnitType, AUTOMATIC) hwUnitId);

/** \brief process channel completion
 *
 *  function to process operations after channel transfer is done
 *
 * \param[in] hwUnitObj: pointer to HW unit object
 * \param[in] jobResult: result of channel completion
 * \param[in] drvObj: pointer to driver object
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_ProcessChCompletion(P2VAR(Spi_HwUnitObjType, AUTOMATIC, SPI_CODE) hwUnitObj,
                        VAR(Spi_JobResultType, AUTOMATIC) jobResult,
                        P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj);
#if (STD_ON == SPI_CS_VIA_GPIO)
/** \brief function to Enable or Disable chip-select when it is a GPIO
 *
 *  function to Enable or disable chip-select what it is a GPIO
 *
 * \param[in] jobObj: pointer to Job object
 * \param[in] enable: enable or disable flag
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_ConfigGpioChipSelect(P2CONST(Spi_JobObjType, AUTOMATIC, SPI_CODE) jobObj, VAR(boolean, AUTOMATIC) enable);
#endif

/** \brief function to cancel ongoing sequence
 *
 *  function to cancel ongoing sequence
 *
 * \param[in] drvObj: pointer to driver object
 * \param[in] seqObj: pointer to Sequence object
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_CancelSequence(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
                   P2VAR(Spi_SeqObjType, AUTOMATIC, SPI_CODE) seqObj);
#if ((SPI_CHANNEL_BUFFERS == SPI_IB) || (SPI_CHANNEL_BUFFERS == SPI_IB_EB))
/** \brief function to write into internal buffer in 8 bits
 *
 *  function to write  into internal buffer
 *
 * \param[in] DataBufferPtr: pointer to Data Buffer
 * \param[out] ChObj: pointer to Channel object
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_PrivIntlBufWrite8(P2VAR(Spi_ChannelObjType, AUTOMATIC, SPI_CODE) ChObj,
                      P2CONST(Spi_DataBufferType, AUTOMATIC, SPI_CODE) DataBufferPtr);

/** \brief function to write  into internal buffer in 16 bits
 *
 *  function to write  into internal buffer
 *
 * \param[in] DataBufferPtr: pointer to Data Buffer
 * \param[out] ChObj: pointer to Channel object
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_PrivIntlBufWrite16(P2VAR(Spi_ChannelObjType, AUTOMATIC, SPI_CODE) ChObj,
                       P2CONST(Spi_DataBufferType, AUTOMATIC, SPI_CODE) DataBufferPtr);

/** \brief function to read  from internal buffer
 *
 *  function to read  from internal buffer
 *
 * \param[in] ChObj: pointer to Channel object
 * \param[out] DataBufferPtr: pointer to Data Buffer
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_PrivReadIB(P2VAR(Spi_ChannelObjType, AUTOMATIC, SPI_CODE) ChObj,
               P2CONST(Spi_DataBufferType, AUTOMATIC, SPI_CODE) DataBufferPtr);
#endif
/** \brief function to get HW Status
 *
 *  function to get HW unit Status
 *
 * \param[in] hwUnitObj: pointer to HWUnit object
 * \pre None
 * \post None
 * \return Status of HWUnit
 * \retval  SPI_UNINIT : The SPI Handler/Driver is not initialized or not usable
 * \retval  SPI_IDLE : The SPI Handler/Driver is not currently transmitting any Job
 * \retval  SPI_BUSY : The SPI Handler/Driver is performing a SPI Job (transmit)
 *
 ********************************************************************************************************************/
FUNC(Spi_StatusType, SPI_CODE)
Spi_PrivGetHWStatus(P2CONST(Spi_HwUnitObjType, AUTOMATIC, SPI_CODE) hwUnitObj);

/** \brief This function process transfer interrupt(TXINT)
 *
 *  function to process transfer interrupt(TXINT)
 *
 * \param[in] baseAddr: Base Address of HWUnit
 * \param[in] chObj: pointer to Channel object
 * \param[in] txIntrStatus: transfer interrupt status
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_PrivProcessTxEvent(VAR(uint32, AUTOMATIC) baseAddr, P2VAR(Spi_ChannelObjType, AUTOMATIC, SPI_CODE) chObj,
                       VAR(uint16, AUTOMATIC) txIntrStatus);

