TexasInstruments/f29h85x-mcal/drivers/Spi/include/Spi_Priv.h
/** \brief function to copy configuration into Job obj
 *
 *  function to reset Job object
 *
 * \param[in] drvObj: pointer to driver object
 * \param[in] cfgPtr: pointer to configuration
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_PrivJobCopyConfig(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
                      P2CONST(Spi_ConfigType, AUTOMATIC, SPI_CODE) cfgPtr);

/** \brief function to copy configuration into Sequence obj
 *
 *  function to reset Sequence object
 *
 * \param[in] drvObj: pointer to driver object
 * \param[in] cfgPtr: pointer to configuration
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_PrivSeqCopyConfig(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
                      P2CONST(Spi_ConfigType, AUTOMATIC, SPI_CODE) cfgPtr);

/** \brief function to copy configuration into Channel obj
 *
 *  function to reset Channel object
 *
 * \param[in] drvObj: pointer to driver object
 * \param[in] cfgPtr: pointer to configuration
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_PrivChannelCopyConfig(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
                          P2CONST(Spi_ConfigType, AUTOMATIC, SPI_CODE) cfgPtr);

/** \brief function to copy configuration into HWUnit obj
 *
 *  function to reset HWUnit object
 *
 * \param[in] drvObj: pointer to driver object
 * \param[in] cfgPtr: pointer to configuration
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_PrivHWUnitCopyConfig(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
                         P2CONST(Spi_ConfigType, AUTOMATIC, SPI_CODE) cfgPtr);

/** \brief function to copy configuration into External Device obj
 *
 *  function to reset External Device object
 *
 * \param[in] drvObj: pointer to driver object
 * \param[in] cfgPtr: pointer to configuration
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_PrivExtDevCopyConfig(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
                         P2CONST(Spi_ConfigType, AUTOMATIC, SPI_CODE) cfgPtr);

/*********************************************************************************************************************
 *  Exported Inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/
/** \brief function to write  into Register in 8 bits
 *
 *  function to write  into  Register
 *
 * \param[in] baseAddr : BaseAddress of HWUnit
 * \param[in] chObj : pointer to Channel object
 * \param[in] transferLength : no.of bytes to transfer
 * \param[in] curTxWords : index of transmitted words in bufPtr
 * \pre None
 * \post None
 * \return pointer to bufPtr
 * \retval pointer to bufPtr
 *
 ********************************************************************************************************************/
LOCAL_INLINE FUNC(void, SPI_CODE)
    Spi_FifoWrite8(VAR(uint32, AUTOMATIC) baseAddr, P2VAR(Spi_ChannelObjType, AUTOMATIC, SPI_CODE) chObj,
                   VAR(uint32, AUTOMATIC) transferLength, VAR(uint16, AUTOMATIC) curTxWords);

/** \brief function to write  into Register in 16 bits
 *
 *  function to write  into  Register
 *
 * \param[in] baseAddr : BaseAddress of HWUnit
 * \param[in] chObj : pointer to Channel object
 * \param[in] transferLength : no.of bytes to transfer
 * \param[in] curTxWords : index of transmitted words in bufPtr
 * \post None
 * \return pointer to bufPtr
 * \retval pointer to bufPtr
 *
 ********************************************************************************************************************/
LOCAL_INLINE FUNC(void, SPI_CODE)
    Spi_FifoWrite16(VAR(uint32, AUTOMATIC) baseAddr, P2VAR(Spi_ChannelObjType, AUTOMATIC, SPI_CODE) chObj,
                    VAR(uint32, AUTOMATIC) transferLength, VAR(uint16, AUTOMATIC) curTxWords);

/** \brief function to read from Register to bufPtr in 8 bits
 *
 *  function to  read from Register
 *
 * \param[in] baseAddr : BaseAddress of HWUnit
 * \param[in] numWordsToRead : no.of bytes to transfer
 * \param[in]  dataWidthBitMask : Clear unused bits
 * \param[in] curRxWords : index of received words in bufPtr
 * \param[out] bufPtr: pointer to Data Buffer
 * \pre None
 * \post None
 * \return pointer to bufPtr
 * \retval pointer to bufPtr
 *
 ********************************************************************************************************************/
LOCAL_INLINE volatile uint8 *Spi_FifoRead8(VAR(uint32, AUTOMATIC) baseAddr,
                                           volatile P2VAR(uint8, AUTOMATIC, SPI_CODE) bufPtr,
                                           VAR(uint32, AUTOMATIC) numWordsToRead,
                                           VAR(uint16, AUTOMATIC) dataWidthBitMask, VAR(uint16, AUTOMATIC) curRxWords);

/** \brief function to read from Register to bufPtr in 16 bits
 *
 *  function to  read from Register
 *
 * \param[in] baseAddr : BaseAddress of HWUnit
 * \param[in] numWordsToRead : no.of bytes to transfer
 * \param[in] dataWidthBitMask : Clear unused bits
 * \param[in] curRxWords : index of received words in bufPtr
 * \param[out] bufPtr: pointer to Data Buffer
 * \pre None
 * \post None
 * \return pointer to bufPtr
 * \retval pointer to bufPtr
 *
 ********************************************************************************************************************/
LOCAL_INLINE uint16 *Spi_FifoRead16(VAR(uint32, AUTOMATIC) baseAddr, P2VAR(uint16, AUTOMATIC, SPI_CODE) bufPtr,
                                    VAR(uint32, AUTOMATIC) numWordsToRead, VAR(uint16, AUTOMATIC) dataWidthBitMask,
                                    VAR(uint16, AUTOMATIC) curRxWords);

