TexasInstruments/f29h85x-mcal/drivers/Spi/include/Spi_Priv.h
/** \brief function to write Default data into Register
 *
 *  function to write default data into  Register
 *
 * \param[in] baseAddr : BaseAddress of HWUnit
 * \param[in] chObj : pointer to Channel object
 * \param[in] transferLength : no.of bytes to transfer
 * \pre None
 * \post None
 * \return pointer to bufPtr
 * \retval pointer to bufPtr
 *
 ********************************************************************************************************************/
LOCAL_INLINE FUNC(void, SPI_CODE)
    Spi_FifoWriteDefault(VAR(uint32, AUTOMATIC) baseAddr, VAR(uint32, AUTOMATIC) transferLength,
                         P2VAR(Spi_ChannelObjType, AUTOMATIC, SPI_CODE) chObj);

/** \brief function to read from Register and discard
 *
 *  function to  read from Register
 *
 * \param[in] baseAddr : BaseAddress of HWUnit
 * \param[in] transferLength : no.of bytes to read
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
LOCAL_INLINE FUNC(void, SPI_CODE)
    Spi_FifoReadDiscard(VAR(uint32, AUTOMATIC) baseAddr, VAR(uint32, AUTOMATIC) transferLength);

/** \brief function to read from Register to Channel Object
 *
 *  function to  read from Register
 *
 * \param[in] baseAddr : BaseAddress of HWUnit
 * \param[out] chObj: pointer to Channel Object
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
LOCAL_INLINE FUNC(void, SPI_CODE)
    Spi_ReadRxBufferNonFifo(P2VAR(Spi_ChannelObjType, AUTOMATIC, SPI_CODE) chObj, VAR(uint32, AUTOMATIC) baseAddr);

/** \brief function to write into Register from Channel Object
 *
 *  function to  write into Register
 *
 * \param[in] baseAddr : BaseAddress of HWUnit
 * \param[out] chObj: pointer to Channel Object
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
LOCAL_INLINE FUNC(void, SPI_CODE)
    Spi_WriteTxBufferNonFifo(P2VAR(Spi_ChannelObjType, AUTOMATIC, SPI_CODE) chObj, VAR(uint32, AUTOMATIC) baseAddr);
/** \brief function to clear PIPE interrupt
 *
 *  function to  write into Register
 *
 * \param[in] intNum : Interrupt vector number
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ********************************************************************************************************************/
LOCAL_INLINE FUNC(void, SPI_CODE) Spi_ClearPIPEINTFlag(VAR(uint32, AUTOMATIC) intNum);

/** \brief  Service for SPI initialization.
 *
 * This service initializes all the configured Spi channels, jobs, sequences and SPI instances This
 *will set the state of SPI driver to Initialized.
 *
 * \param[in] CfgPtr - Pointer to configuration set
 * \param[in] drvObj - Pointer to Driver Object
 * \pre CfgPtr shall be null in Pre-Compile variant, Link-Time variant and shall not be NULL in
 *Post-Build variant
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, SPI_CODE)
Spi_PrivInit(P2VAR(Spi_DriverObjType, AUTOMATIC, SPI_CODE) drvObj,
             P2CONST(Spi_ConfigType, AUTOMATIC, SPI_CONFIG_DATA) CfgPtr);
/*********************************************************************************************************************
 *  Mark the end of the C bindings section for C++ compilers.
 *********************************************************************************************************************/
#ifdef __cplusplus
}
#endif
#endif /* SPI_PRIV_H */
/*********************************************************************************************************************
 *  End of File: Spi_Priv.h
 *********************************************************************************************************************/
